onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_ОчередьСообщенийMAX.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_ОчередьСообщенийMAX</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Рассылки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Контакты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТелоJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресатJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попытка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Попыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АрендаДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Создано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обновлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/InformationRegisters/бит_омни_АктивныеРассылки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_омни_АктивныеРассылки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачалаПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗавершенияПоследнегоЗапуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Рассылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Рассылки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_омни_Боты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Enums/бит_омни_КаналыСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_омни_КаналыСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MAX</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Боты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Боты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_КаналыСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/CommonModules/бит_омни_ОчередьСообщенийMAX/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Вызывается из ПриЗаписи внутри транзакции объекта. Получатели и контекст уже
// отобраны СКД. Здесь сохраняется снимок, сетевых вызовов нет.
Процедура ПоставитьПриЗаписи(Источник, Рассылка, Бот, Получатели, Контекст) Экспорт
	Если Бот.Канал <> Перечисления.бит_омни_КаналыСвязи.MAX Тогда
		Возврат;
	КонецЕсли;
	Если НЕ ТранзакцияАктивна() Тогда
		ВызватьИсключение "Очередь при записи должна формироваться в транзакции объекта.";
	КонецЕсли;
	Если Контекст.Количество() > 1 Тогда
		ВызватьИсключение "Контекст рассылки при записи должен возвращать не более одной строки.";
	КонецЕсли;
	ИдентификаторИсточника = Источник.Метаданные().ПолноеИмя() + ":"
		+ Строка(Источник.Ссылка.УникальныйИдентификатор());
	Группа = ХешКлюча(ИдентификаторИсточника + ":" + Строка(Рассылка.УникальныйИдентификатор())
		+ ":" + Строка(Бот.УникальныйИдентификатор()));
	ЗаблокироватьГруппу(Группа);
	Набор = РегистрыСведений.бит_омни_ОчередьСообщенийMAX.СоздатьНаборЗаписей();
	Набор.Отбор.Группа.Установить(Группа);
	Набор.Прочитать();
	Таблица = Набор.Выгрузить();
	Таблица.Индексы.Добавить("Ключ");
	АктуальныеКлючи = Новый Соответствие;
	Момент = ТекущаяДатаСеанса();
	Настройка = Рассылка.ПолучитьОбъект();
	Если Контекст.Количество() = 1 И НЕ Источник.ПометкаУдаления Тогда
		Снимки = бит_омни_ИнтеграцияСMAX.ПодготовитьСообщенияДляОчереди(
			Настройка.Шаблон, Получатели, Бот, Контекст[0]);
		Если Настройка.ДатыСобытия.Количество() = 0 Тогда
			ДобавитьСнимки(Таблица, АктуальныеКлючи, Группа, ИдентификаторИсточника,
				Бот, Рассылка, "IMMEDIATE", Момент, Снимки, Момент);
		Иначе
			Для Каждого Правило Из Настройка.ДатыСобытия Цикл
				ДатаОтправки = бит_омни_ДатыСобытияРассылок.РассчитатьДату(Правило, Контекст[0]);
				Если ДатаОтправки <> Неопределено Тогда
					ДобавитьСнимки(Таблица, АктуальныеКлючи, Группа, ИдентификаторИсточника,
						Бот, Рассылка, Правило.ИдентификаторСтроки, ДатаОтправки, Снимки, Момент);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Для Каждого СтрокаОчереди Из Таблица Цикл
		// Условие первоначального события может стать ложным на следующей записи:
		// уже подготовленное немедленное сообщение из-за этого не отменяем.
		Отменять = СтрокаОчереди.Правило <> "IMMEDIATE" Или Источник.ПометкаУдаления;
		Если Отменять И СтрокаОчереди.Состояние = "Ожидает"
			И АктуальныеКлючи.Получить(СтрокаОчереди.Ключ) = Неопределено Тогда
			СтрокаОчереди.Состояние = "Отменено";
			СтрокаОчереди.Обновлено = Момент;
			СтрокаОчереди.ОписаниеОшибки = "Условие, дата, правило или получатель изменились при записи объекта.";
		КонецЕсли;
	КонецЦикла;
	Набор.Загрузить(Таблица);
	Набор.Записать();
КонецПроцедуры

// Периодический производитель вызывает внутри транзакции фиксации запуска.
// У каждого запуска свой ключ; даты событий к этому режиму не применяются.
Процедура ПоставитьПериодическуюРассылку(Бот, Рассылка, МоментЗапуска, Снимки) Экспорт
	Если НЕ ТранзакцияАктивна() Тогда
		ВызватьИсключение "Периодическая очередь должна формироваться в транзакции запуска.";
	КонецЕсли;
	ИдентификаторИсточника = "SCHEDULE:" + Строка(Рассылка.УникальныйИдентификатор())
		+ ":" + Формат(МоментЗапуска, "ДФ=yyyyMMddHHmmss");
	Группа = ХешКлюча(ИдентификаторИсточника + ":" + Строка(Бот.УникальныйИдентификатор()));
	ЗаблокироватьГруппу(Группа);
	Набор = РегистрыСведений.бит_омни_ОчередьСообщенийMAX.СоздатьНаборЗаписей();
	Набор.Отбор.Группа.Установить(Группа);
	Набор.Прочитать();
	Таблица = Набор.Выгрузить();
	Таблица.Индексы.Добавить("Ключ");
	ДобавитьСнимки(Таблица, Новый Соответствие, Группа, ИдентификаторИсточника,
		Бот, Рассылка, "SCHEDULE", МоментЗапуска, Снимки, МоментЗапуска);
	Набор.Загрузить(Таблица);
	Набор.Записать();
КонецПроцедуры

// Отдельное регламентное задание. Не вызывается из входящего long polling.
// До 100 сообщений за запуск. Нет автоматических повторов сетевой отправки.
Процедура ВыполнитьОтправку() Экспорт
	Если ТранзакцияАктивна() Тогда
		ВызватьИсключение "Обработчик очереди нельзя запускать внутри транзакции.";
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ Боты.Ссылка КАК Бот
	|ИЗ Справочник.бит_омни_Боты КАК Боты
	|ГДЕ Боты.Использовать И НЕ Боты.ПометкаУдаления
	| И Боты.Канал = ЗНАЧЕНИЕ(Перечисление.бит_омни_КаналыСвязи.MAX)");
	Для Каждого СтрокаБота Из Запрос.Выполнить().Выгрузить() Цикл
		Попытка
			бит_омни_НапоминанияMAX.ВыполнитьНапоминания(СтрокаБота.Бот);
		Исключение
			ЗаписьЖурналаРегистрации("МАКС.Очередь.Расписание", УровеньЖурналаРегистрации.Ошибка,
				,, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 100 Очередь.Группа КАК Группа, Очередь.Ключ КАК Ключ
	|ИЗ РегистрСведений.бит_омни_ОчередьСообщенийMAX КАК Очередь
	| ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_омни_АктивныеРассылки КАК Активные
	| ПО Активные.Бот = Очередь.Бот И Активные.Рассылка = Очередь.Рассылка
	|ГДЕ (Очередь.Состояние = ""Ожидает"" И Очередь.ДатаОтправки <= &Момент
	| И Очередь.Бот.Использовать И НЕ Очередь.Бот.ПометкаУдаления
	| И НЕ Очередь.Рассылка.ПометкаУдаления
	| И НЕ Активные.Рассылка ЕСТЬ NULL)
	| ИЛИ (Очередь.Состояние = ""ВРаботе"" И Очередь.АрендаДо <= &Момент)
	|УПОРЯДОЧИТЬ ПО Очередь.ДатаОтправки, Очередь.Группа, Очередь.Ключ";
	Запрос.УстановитьПараметр("Момент", ТекущаяДатаСеанса());
	Для Каждого Кандидат Из Запрос.Выполнить().Выгрузить() Цикл
		Попытка
			// Адресные чтения здесь необходимы для атомарного захвата каждой строки
			// конкурирующими заданиями. Сетевой вызов выполняется вне транзакции.
			Сообщение = ЗахватитьСообщение(Кандидат.Группа, Кандидат.Ключ);
			Если Сообщение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Попытка
				Результат = бит_омни_ИнтеграцияСMAX.ОтправитьПодготовленноеСообщение(
					Сообщение.Бот, Сообщение.Контакт, Сообщение.ТелоJSON, Сообщение.АдресатJSON);
			Исключение
				Результат = Новый Структура("Состояние,ИдентификаторСообщения,ОписаниеОшибки",
					"Неопределено", "", "Сбой отправки: результат неизвестен. Проверьте историю MAX.");
			КонецПопытки;
			ЗавершитьОтправку(Кандидат.Группа, Кандидат.Ключ, Сообщение.Попытка, Результат);
		Исключение
			ЗаписьЖурналаРегистрации("МАКС.Очередь.Ошибка", УровеньЖурналаРегистрации.Ошибка,
				,, "Ключ: " + Кандидат.Ключ + ". " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

// Атомарный захват также доступен серверным проверкам без отправки в сеть.
// Возвращает менеджер записи со снимком либо Неопределено.
Функция ЗахватитьСообщение(Группа, Ключ) Экспорт
	Если ТранзакцияАктивна() Тогда
		ВызватьИсключение "Захват должен фиксироваться отдельной транзакцией до отправки.";
	КонецЕсли;
	Результат = Неопределено;
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьГруппу(Группа);
		Запись = ПрочитатьЗапись(Группа, Ключ);
		Если Запись.Выбран() Тогда
			Если Запись.Состояние = "ВРаботе" И Запись.АрендаДо <= ТекущаяДатаСеанса() Тогда
				Запись.Состояние = "Неопределено";
				Запись.ОписаниеОшибки = "Истек срок захвата. Доставка неизвестна; автоповтор запрещен.";
				Запись.Обновлено = ТекущаяДатаСеанса();
				Запись.Записать();
			ИначеЕсли Запись.Состояние = "Ожидает" И Запись.ДатаОтправки <= ТекущаяДатаСеанса()
				И РассылкаАктивна(Запись.Бот, Запись.Рассылка) Тогда
				Запись.Состояние = "ВРаботе";
				Запись.Попытка = Строка(Новый УникальныйИдентификатор);
				Запись.Попыток = Запись.Попыток + 1;
				Запись.АрендаДо = ТекущаяДатаСеанса() + 300;
				Запись.Обновлено = ТекущаяДатаСеанса();
				Запись.Записать();
				Результат = Запись;
			КонецЕсли;
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Результат: Состояние, ИдентификаторСообщения, ОписаниеОшибки.
// Записывается только для UUID захватившей попытки, включая поздний ответ.
Процедура ЗавершитьОтправку(Группа, Ключ, ПопыткаДоставки, Результат) Экспорт
	Если ТранзакцияАктивна() Тогда
		ВызватьИсключение "Результат отправки фиксируется отдельной транзакцией.";
	КонецЕсли;
	Если Результат.Состояние <> "Отправлено" И Результат.Состояние <> "Ошибка"
		И Результат.Состояние <> "Неопределено" Тогда
		ВызватьИсключение "Недопустимый результат доставки.";
	КонецЕсли;
	НачатьТранзакцию();
	Попытка
		ЗаблокироватьГруппу(Группа);
		Запись = ПрочитатьЗапись(Группа, Ключ);
		Если Запись.Выбран() И Запись.Попытка = ПопыткаДоставки
			И (Запись.Состояние = "ВРаботе" Или Запись.Состояние = "Неопределено") Тогда
			Запись.Состояние = Результат.Состояние;
			Запись.ИдентификаторСообщения = Лев(Результат.ИдентификаторСообщения, 150);
			Запись.ОписаниеОшибки = Лев(Результат.ОписаниеОшибки, 1000);
			Запись.Обновлено = ТекущаяДатаСеанса();
			Запись.АрендаДо = Дата(1, 1, 1);
			Запись.Записать();
		КонецЕсли;
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьСнимки(Таблица, АктуальныеКлючи, Группа, Источник,
	Бот, Рассылка, Правило, ДатаОтправки, Снимки, Момент)
	Для Каждого Снимок Из Снимки Цикл
		// Текст не входит в идентичность события: его изменение обновляет только
		// ожидающее сообщение, но не порождает повтор уже отправленного/ошибочного.
		ЧастьДаты = ?(Правило = "IMMEDIATE", "IMMEDIATE", Формат(ДатаОтправки, "ДФ=yyyyMMddHHmmss"));
		Ключ = ХешКлюча(Группа + ":" + Строка(Снимок.Контакт.УникальныйИдентификатор())
			+ ":" + Правило + ":" + ЧастьДаты);
		АктуальныеКлючи.Вставить(Ключ, Истина);
		СтрокаОчереди = Таблица.Найти(Ключ, "Ключ");
		Если СтрокаОчереди = Неопределено Тогда
			// Старое событие не рассылается задним числом при первой записи.
			// Уже созданная просроченная очередь при этом остается к отправке.
			Если ДатаОтправки < Момент И Правило <> "IMMEDIATE" Тогда
				Продолжить;
			КонецЕсли;
			СтрокаОчереди = Таблица.Добавить();
			СтрокаОчереди.Группа = Группа;
			СтрокаОчереди.Ключ = Ключ;
			СтрокаОчереди.Создано = Момент;
			СтрокаОчереди.Состояние = "Ожидает";
			СтрокаОчереди.ДатаОтправки = ДатаОтправки;
		ИначеЕсли СтрокаОчереди.Состояние = "Отменено" И СтрокаОчереди.Попыток = 0
			И ДатаОтправки >= Момент Тогда
			СтрокаОчереди.Состояние = "Ожидает";
		КонецЕсли;
		Если СтрокаОчереди.Состояние <> "Ожидает" Тогда
			Продолжить;
		КонецЕсли;
		СтрокаОчереди.Бот = Бот;
		СтрокаОчереди.Рассылка = Рассылка;
		СтрокаОчереди.Контакт = Снимок.Контакт;
		СтрокаОчереди.Источник = Источник;
		СтрокаОчереди.Правило = Правило;
		СтрокаОчереди.ТелоJSON = Снимок.ТелоJSON;
		СтрокаОчереди.АдресатJSON = Снимок.АдресатJSON;
		СтрокаОчереди.Обновлено = Момент;
		СтрокаОчереди.ОписаниеОшибки = "";
	КонецЦикла;
КонецПроцедуры

Функция ХешКлюча(Значение)
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(Значение);
	Возврат НРег(СтрЗаменить(Строка(Хеш.ХешСумма), " ", ""));
КонецФункции

Процедура ЗаблокироватьГруппу(Группа)
	Блокировка = Новый БлокировкаДанных;
	Элемент = Блокировка.Добавить("РегистрСведений.бит_омни_ОчередьСообщенийMAX");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.УстановитьЗначение("Группа", Группа);
	Блокировка.Заблокировать();
КонецПроцедуры

Функция ПрочитатьЗапись(Группа, Ключ)
	Запись = РегистрыСведений.бит_омни_ОчередьСообщенийMAX.СоздатьМенеджерЗаписи();
	Запись.Группа = Группа;
	Запись.Ключ = Ключ;
	Запись.Прочитать();
	Возврат Запись;
КонецФункции

Функция РассылкаАктивна(Бот, Рассылка)
	Если НЕ Бот.Использовать Или Бот.ПометкаУдаления Или Рассылка.ПометкаУдаления
		Или Бот.Канал <> Перечисления.бит_омни_КаналыСвязи.MAX Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Активные.Рассылка КАК Рассылка
	|ИЗ РегистрСведений.бит_омни_АктивныеРассылки КАК Активные
	|ГДЕ Активные.Бот = &Бот И Активные.Рассылка = &Рассылка");
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("Рассылка", Рассылка);
	Возврат НЕ Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти
